app/controllers/reviews_controller.rb

	def index
	  @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

	def new
	  @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]

	def create
	  @movie = Movie.find(params[:movie_id])
	  @review = @movie.reviews.new(review_params)
	  if @review.save
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Test"], ["created_at", Sat, 10 May 2014 09:02:46 UTC +00:00], ["movie_id", 7], ["name", "Hold 1"], ["stars", 2], ["updated_at", Sat, 10 May 2014 09:02:46 UTC +00:00]]